{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iron Realms Nexus Event Bus Blog",
    "home_page_url": "https://keneanung.github.io/@keneanung/nexus-event-bus/blog",
    "description": "Iron Realms Nexus Event Bus Blog",
    "items": [
        {
            "id": "/2021/04/11/_Initial_Release",
            "content_html": "<p><code>Hello World!</code></p><p>And with that out of the way, I present the first release on my event bus package for the Nexus MUD client.</p><p>While there are already implementations of the event bus for the Nexus MUD client (ie as part of the NexSys and NexGUI projects), I wanted to make a package that is not part of a larger project. Instead this project can be installed individually and be used as a dependency for other projects. This should make it easier for the community to adapt a set of lightweight standard packages that still allow the users a large amount of flexibility to use the packages they like.</p><p>This release is the minimal viable product and contains the most basic functionality: Registering event handlers, raising events and unregistering event handlers. The <a href=\"https://keneanung.github.io/nexus-event-bus/docs/api\" target=\"_blank\" rel=\"noopener noreferrer\">API documentation</a> has all the gritty details.</p><p>More features may be added in the future. Feel free to <a href=\"https://github.com/keneanung/nexus-event-bus/issues/new\" target=\"_blank\" rel=\"noopener noreferrer\">create a new issue</a> to discuss further extnsions.</p><p>If you like my work and want to support me, please consider <a href=\"https://github.com/sponsors/keneanung\" target=\"_blank\" rel=\"noopener noreferrer\">sponsoring me</a>.</p><p>Oh, and why is the initial release version <code>0.0.3</code>? Well, I messed up the packaging, so I had to redo it a few times. I'm sorry.</p>",
            "url": "https://keneanung.github.io/@keneanung/nexus-event-bus/blog/2021/04/11/_Initial_Release",
            "title": "Initial Release v0.0.3",
            "summary": "Hello World!",
            "date_modified": "2021-04-11T00:00:00.000Z",
            "author": {
                "name": "keneanung",
                "url": "https://github.com/keneanung"
            },
            "tags": []
        }
    ]
}